<a href="https://colab.research.google.com/github/obeabi/Assignments/blob/master/Main_DataCleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pyhton Assignment : Data cleaning assignment
# Written by Abiola Obembe
## Date: 2020-12-21
## Course: ML masters with deployment and deep learning

In [223]:
# import libraries
import pandas as pd
import numpy as np

print("Installation complete!")

Installation complete!

In [224]:
"""
Problem Statement
It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:

"""

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
                    'londON_StockhOlm',
                    'Budapest_PaRis', 'Brussels_londOn'],
                  'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                  'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                  'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                              '12. Air France', '"Swiss Air"']})

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## Question 1

Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column)

In [225]:
# Solution Code Here
df ['FlightNumber'].fillna({1: 10055, 3:10075}, inplace = True, downcast = 'int')
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## Question 2
The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [226]:
# Print Code Here
df_temp = df.copy()

locations = df_temp['From_To'].str.split('_', n =1, expand = True)

# Create column name for From and To
locations.columns = ["From", "To"]
locations

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## Question 3
Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [227]:
# Print Code Here

for cols in locations.columns:
  locations[cols] = locations[cols].str.lower().str.capitalize()


locations

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## Question 4

Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [228]:
# Print code here
df.drop(columns=['From_To' ], axis = 1, inplace= True)

df_new = pd.concat((df,locations),axis = 1)

df_new

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

## Question 5

In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [229]:
for index,row in df_new.iterrows():
  for i, days in enumerate(row['RecentDelays']):
    df_new.at[index,"delay_"+str(i+1)] = days

df_new

   FlightNumber  RecentDelays              Airline  ... delay_1 delay_2  delay_3
0         10045      [23, 47]               KLM(!)  ...    23.0    47.0      NaN
1         10055            []    <Air France> (12)  ...     NaN     NaN      NaN
2         10065  [24, 43, 87]  (British Airways. )  ...    24.0    43.0     87.0
3         10075          [13]       12. Air France  ...    13.0     NaN      NaN
4         10085      [67, 32]          "Swiss Air"  ...    67.0    32.0      NaN

[5 rows x 8 columns]